CD2DPathGeometry.m_pPathGeometry
A pointer to an ID2D1PathGeometry.

CD2DPathGeometry.GetFigureCount
Retrieves the number of figures in the path geometry.
Returns:
Returns the number of figures in the path geometry.

CD2DPathGeometry.GetSegmentCount
Retrieves the number of segments in the path geometry.
Returns:
Returns the number of segments in the path geometry.

CD2DPathGeometry.Stream(ID2D1GeometrySink*)
Copies the contents of the path geometry to the specified ID2D1GeometrySink.
Returns:
If the method succeeds, it returns TRUE. Otherwise, it returns FALSE.
geometrySink: The sink to which the path geometry's contents are copied. Modifying this sink does not change the contents of this path geometry.

CD2DPathGeometry.Open
Retrieves the geometry sink that is used to populate the path geometry with figures and segments.
Returns:
A pointer to the ID2D1GeometrySink that is used to populate the path geometry with figures and segments.

CD2DPathGeometry.Detach
Detaches resource interface from the object
Returns:
Pointer to detached resource interface.

CD2DPathGeometry.Attach(ID2D1PathGeometry*)
Attaches existing resource interface to the object
pResource: Existing resource interface. Cannot be NULL

CD2DPathGeometry.Destroy
Destroys a CD2DPathGeometry object.

CD2DPathGeometry.Create(CRenderTarget*)
Creates a CD2DPathGeometry.
Returns:
If the method succeeds, it returns S_OK. Otherwise, it returns an HRESULT error code.
pRenderTarget: A pointer to the render target.

CD2DPathGeometry.#ctor(CRenderTarget*,System.Int32)
Constructs a CD2DPathGeometry object.
pParentTarget: A pointer to the render target.
bAutoDestroy: Indicates that the object will be destroyed by owner (pParentTarget).

CD2DPathGeometry
ID2D1PathGeometry wrapper.